[ViperElite X2CharacterTemplate]
strCharacterName="Viper Elite"
strAcquiredText="Viper Elite" 

[PoisonSpitElite X2AbilityTemplate]
LocFriendlyName="Poison Spit"
LocLongDescription="A Viper can project a blast of venom at long range that explodes into a toxic cloud that disorients."
LocHelpText="Spit deadly poison at an area."
LocFlyOverText="Poison Spit"

[BlackSplitGlob X2GrenadeTemplate]
FriendlyName="Poison Spit"
FriendlyNamePlural="Poison Spit"
BriefSummary="A Viper can project a blast of venom at long range that explodes into a toxic cloud that disorients."
TacticalText="<Bullet/> Spit deadly poison at an area."

[ViperElite_WPN X2WeaponTemplate]
FriendlyName="Beam Rifle"
FriendlyNamePlural="Beam Rifles"
BriefSummary="XCOM has managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage, once a standard technical approach is discovered."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness."

[Viper_Tongue_Elite_WPN X2WeaponTemplate]
FriendlyName="Viper Tongue"
FriendlyNamePlural="Viper Tongues"
BriefSummary="XCOM has managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage, once a standard technical approach is discovered."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness."

[GetOverHereElite X2AbilityTemplate]
LocFriendlyName="Tongue Pull"
LocLongDescription="A Viper's tongue and neck are immensely strong, and can yank an adult human into its coils from far away."
LocHelpText="Grab a target with your tongue and pull them to melee range. Only humanoid targets can be pulled."
LocFlyOverText="Tongue Grab"
LocMissMessage="Grab Failed!"

[BindElite X2AbilityTemplate]
LocFriendlyName="Bind and Crush"
LocLongDescription="The coils of a Viper are inhumanly strong, and can bind and crush an adjacent humanoid enemy."
LocHelpText="Bind and crush an adjacent humanoid enemy."
LocFlyOverText="Bind"
LocMissMessage="Bind Failed!"